leetcode_338_counting_bits.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Leetcode: 338. Counting Bits</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="style.css">

</head>
<body>
<!--  --><nav><span class="nav-header">Problem Solving</span><span class="nav-items"><a href="index.html">Home</a><span></nav><div id="content" class="content">
<h1 class="title">Leetcode: 338. Counting Bits</h1>
<p>
<a href="https://leetcode.com/problems/counting-bits/">Problem Statement</a>
</p>

<div id="outline-container-org8a4622a" class="outline-2">
<h2 id="org8a4622a">Pattern</h2>
<div class="outline-text-2" id="text-org8a4622a">
<ul class="org-ul">
<li><a href="pattern_compute_a_sequence_of_values_of_a_function.html#ID-092270C4-16DA-461A-AC1C-62CED4314E34">Pattern: Compute a sequence of values of a function</a></li>
<li><a href="pattern_bitwise_problem.html#ID-196F904D-BBEF-43CD-BAB5-B8BC563280F8">Pattern: Bitwise problem</a></li>
</ul>
</div>
</div>

<div id="outline-container-org8f1f360" class="outline-2">
<h2 id="org8f1f360">Solution</h2>
<div class="outline-text-2" id="text-org8f1f360">
<p>
Given an integer \(n\), the task is to generate an array \(a\) of \(n+1\) elements where \(a[i]\) is equal to the number of 1 bits in \(i\).  The simplest solution is to iterate over each index \(i\) and use <a href="leetcode_191_number_of_1_bits.html#ID-9C506DBD-693B-46D8-9CA4-8B7C7D573092">Leetcode: 191. Number of 1 Bits</a> to compute \(a[i]\).  The time complexity of this solution is \(O(n \log n)\).  We can do better.  Note that \(a[i]\) is equal to one plus \(a[j]\) where \(j\) is \(i\) with the last significant digit turned of.  For example, \(i=3 (0b011)\) then \(j=2 (0b010)\) and \(i=12 (0b01100)\) then \(j=8 (0b01000)\).  Luckily, it is easy to compute \(j\): \(i & (i - 1)\).  With this observation, we can solve the problem in time complexity $O(n).
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold;">class</span> <span style="font-weight: bold; text-decoration: underline;">Solution</span>:
    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">countBits</span>(<span style="font-weight: bold;">self</span>, n: <span style="font-weight: bold;">int</span>) -&gt; <span style="font-weight: bold; font-style: italic;">List</span>[<span style="font-weight: bold;">int</span>]:
        ans = [0] * (n + 1)
        <span style="font-weight: bold;">for</span> i <span style="font-weight: bold;">in</span> <span style="font-weight: bold;">range</span>(1, n + 1):
            <span style="font-weight: bold; font-style: italic;">ans</span>[<span style="font-weight: bold; font-style: italic;">i</span>] = ans[i &amp; (i - 1)] + 1
        <span style="font-weight: bold;">return</span> ans
</pre>
</div>
</div>
</div>


<div id="outline-container-orgb54df86" class="outline-2">
<h2 id="orgb54df86">Cited by 1</h2>
<div class="outline-text-2" id="text-orgb54df86">
<ul class="org-ul">
<li><a href="interview_preparation_v.html#ID-8C7E9E52-9220-4A7B-B0E6-54F960E17CA8">Interview preparation: V</a></li>
</ul>
</div>
</div>
</div>
</body>
</html>